    //***************************************************************
//*  程序名：实训2_1.cp                                         *
//*  主要功能：                                                 *
//*     显示主菜单，并获取用户输入的模块编号                    *
//***************************************************************
#include <bits/stdc++.h>                         // 包含输入输出接口文件
using namespace std;                        // 引用标准命名空间
int main()                                  // 定义主函数
{                                           // 主函数开始
    int n;
    system("cls");
    cout<<"\n\n\n\n\n";
    cout<<"\t\t|---------------学生选课系统(学生版)-----------|\n";
    cout<<"\t\t|\t 0. 退出                               |\n";
    cout<<"\t\t|\t 1. 学生信息管理                       |\n";
    cout<<"\t\t|\t 2. 教师信息管理                       |\n";
    cout<<"\t\t|\t 3. 课程信息管理                       |\n";
    cout<<"\t\t|\t 4. 学生选课管理                       |\n";
    cout<<"\t\t|----------------------------------------------|\n\n";
    cout<<"\t\t\t请输入模块编号(0-4):";
    cin>>n;
    cout<<"你输入的模块编号为"<<n<<endl;
    return 0;                               // 返回0，表示正常结束
}